arnaldojr/CursoPIC/labintegrado2014/Documentação/cd labtools/mclab3/Exemplos/PIC18F4550/Exemplo 23 - exemplos LCD 128 x 64/Exe4/Exe4.c
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *              Exemplo de Código para utilização com a McLab3             *
 *                          Exemplo 23 (Exe 4)                             *
 *                                                                         *
 *                               MOSAICO                                   *
 *                                                                         *
 *  TEL: (0XX11) 4992-8775               SITE: www.mosaico.com.br          *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *   VERSÃO : 1.0                                                          *
 *   DATA : 10/05/2011                                                     *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * *  * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *                             Descrição geral                             *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/*
	Este software demonstra como realizar a comunicação entre o controlador 
	touch-screen e o microcontrolador. Neste exemplo temos 2 botões impressos 
	na tela e a ação é ligar e desligar um relé.
*/

// Observação: ligar a chave SCK(RB1), SDI(RC4), SCK(RC7) e CS-TOUCH

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *                DEFINIÇÃO DAS VARIÁVEIS INTERNAS DO PIC                  *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

#include <p18F4550.h>        	 // Register definitions
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include <delays.h>        		 //Delay library functions

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *                         Configurações para gravação                   *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

#pragma config FOSC 	= HS
#pragma config CPUDIV 	= OSC4_PLL6
#pragma config WDT 		= OFF
#pragma config WDTPS 	= 128
#pragma config LVP 		= OFF
#pragma config PWRT	    = ON
#pragma config BOR 		= ON
#pragma config BORV 	= 2
#pragma config PBADEN 	= OFF
#pragma config DEBUG 	= OFF
#pragma config PLLDIV 	= 1
#pragma config USBDIV 	= 1
#pragma config FCMEN 	= OFF
#pragma config IESO 	= OFF
#pragma config VREGEN 	= OFF
#pragma config MCLRE 	= ON
#pragma config LPT1OSC 	= OFF
#pragma config CCP2MX 	= OFF
#pragma config STVREN 	= OFF
#pragma config ICPRT 	= OFF
#pragma config XINST 	= OFF
#pragma config CP0 		= OFF
#pragma config CP1 		= OFF
#pragma config CP2 		= OFF
#pragma config CP3 		= OFF
#pragma config CPB 		= OFF
#pragma config CPD 		= OFF
#pragma config WRT0 	= OFF
#pragma config WRT1 	= OFF
#pragma config WRT2 	= OFF
#pragma config WRT3 	= OFF
#pragma config WRTB 	= OFF
#pragma config WRTC 	= OFF
#pragma config WRTD 	= OFF
#pragma config EBTR0 	= OFF
#pragma config EBTR1 	= OFF
#pragma config EBTR2 	= OFF
#pragma config EBTR3 	= OFF
#pragma config EBTRB 	= OFF

//
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *                INCLUDES DAS FUNÇÕES DE PERIFÉRICOS DO PIC             *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *                       PROTOTIPAGEM DE FUNÇÕES                         *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

void glcd_init(unsigned char mode);
void glcd_pixel(unsigned char x, unsigned char y, unsigned char color);
void glcd_line(unsigned char x1, unsigned char y1, unsigned char x2, unsigned char y2, unsigned char color);
void glcd_rect(unsigned char x1, unsigned char y1, unsigned char x2, unsigned char y2, unsigned char fill, unsigned char color);
void glcd_bar(unsigned char x1, unsigned char y1, unsigned char x2, unsigned char y2, unsigned char width, unsigned char color);
void glcd_circle(unsigned char x, unsigned char y, unsigned char radius, unsigned char fill, unsigned char color);
void glcd_text57(unsigned char x, unsigned char y, unsigned char *textptr, unsigned char size, unsigned char color);
void glcd_fillScreen(unsigned char color);
void glcd_writeByte(unsigned char chip, unsigned char data);
unsigned char glcd_readByte(unsigned char chip);

unsigned char leitura_touch(unsigned char eixo);
void filtro_touch(unsigned char canal);
unsigned char retorna_pixel(unsigned char eixo, unsigned char valor);

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *                           Constantes internas                           *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
//A definição de constantes facilita a programação e a manutenção.

#define GLCD_WIDTH 128    // Used for text wrapping by glcd_text57 function

#define X  1
#define Y  0

#define ON  1
#define OFF 0

#define YES 1
#define NO  0

#define	TRUE   1
#define FALSE  0

#define SEL_GLCD_CS1 0
#define SEL_GLCD_CS2 1

#define MAX_X 235       //calibração com as posições min e max de x e y
#define MIN_X 14
#define MAX_Y 226
#define MIN_Y 29

#define TXT1_X1  25    //posição do texto 1
#define TXT1_Y1  40

#define TXT2_X1  85    //posição do texto 2
#define TXT2_Y1  40

#define BOT1_X1  TXT1_X1-2  //coordenada do botão 1
#define BOT1_Y1  TXT1_Y1-2
#define BOT1_X2  BOT1_X1+14
#define BOT1_Y2  BOT1_Y1+10

#define BOT2_X1  TXT2_X1-2  //coordenada do botão 2
#define BOT2_Y1  TXT2_Y1-2
#define BOT2_X2  BOT2_X1+20 
#define BOT2_Y2  BOT2_Y1+10
 
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *                 Definição e inicialização das variáveis                 *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
//Neste bloco estão definidas as variáveis globais do programa.

unsigned char buffer_latch_controle,aux = 0;
unsigned int  temp_coluna_touch,temp_linha_touch,aux1;
unsigned char texto[4];

unsigned char texto1[] = "VENTILADOR:";
unsigned char texto2[] = "ON";
unsigned char texto3[] = "OFF";

unsigned char filtro_linha_touch_press;
unsigned char filtro_coluna_touch_press;
unsigned char filtro_linha_touch_lib;
unsigned char filtro_coluna_touch_lib;
unsigned char linha_touch_ok;
unsigned char coluna_touch_ok;
unsigned char pos_touch_ok;

