arnaldojr/CursoPIC/labintegrado2014/Documentação/cd labtools/mclab3/Exemplos/PIC18F4550/Exemplo 23 - exemplos LCD 128 x 64/Exe4/Exe4.c
unsigned char linha_touch_anterior;
unsigned char coluna_touch_anterior;
unsigned char linha_touch;
unsigned char coluna_touch;

unsigned char t_f_touch_press = 10;			// FILTRO DE PRESS. DE DEBOUNCE DO TOUCH (MULTIPLOS DE 1ms)
unsigned char t_f_touch_lib   =  2;			// FILTRO DE LIBER. DE DEBOUNCE DO TOUCH (MULTIPLOS DE 1ms)

unsigned char pos_pixel_x;
unsigned char pos_pixel_y;

#pragma romdata tabela = 0x100
const rom unsigned char TEXT[96][5] = {		
									 0x00, 0x00, 0x00, 0x00, 0x00, // SPACE    32
					                 0x00, 0x00, 0x5F, 0x00, 0x00, // !	33
					                 0x00, 0x03, 0x00, 0x03, 0x00, // "	34
					                 0x14, 0x3E, 0x14, 0x3E, 0x14, // #	35
					                 0x24, 0x2A, 0x7F, 0x2A, 0x12, // $	36
					                 0x43, 0x33, 0x08, 0x66, 0x61, // %	37
					                 0x36, 0x49, 0x55, 0x22, 0x50, // &	38
					                 0x00, 0x05, 0x03, 0x00, 0x00, // '	39	
					                 0x00, 0x1C, 0x22, 0x41, 0x00, // (	40
					                 0x00, 0x41, 0x22, 0x1C, 0x00, // )	41
					                 0x14, 0x08, 0x3E, 0x08, 0x14, // *	42
					                 0x08, 0x08, 0x3E, 0x08, 0x08, // +	43
					                 0x00, 0x50, 0x30, 0x00, 0x00, // ,	44
					                 0x08, 0x08, 0x08, 0x08, 0x08, // -	45
					                 0x00, 0x60, 0x60, 0x00, 0x00, // .	46
					                 0x20, 0x10, 0x08, 0x04, 0x02, // /	47
									 0x3E, 0x51, 0x49, 0x45, 0x3E, // 0	48
			                         0x04, 0x02, 0x7F, 0x00, 0x00, // 1	49
			                         0x42, 0x61, 0x51, 0x49, 0x46, // 2	50
			                         0x22, 0x41, 0x49, 0x49, 0x36, // 3	51
			                         0x18, 0x14, 0x12, 0x7F, 0x10, // 4	521
			                         0x27, 0x45, 0x45, 0x45, 0x39, // 5	53
			                         0x3E, 0x49, 0x49, 0x49, 0x32, // 6	54
			                         0x01, 0x01, 0x71, 0x09, 0x07, // 7	55
			                         0x36, 0x49, 0x49, 0x49, 0x36, // 8	56
			                         0x26, 0x49, 0x49, 0x49, 0x3E, // 9	57
			                         0x00, 0x36, 0x36, 0x00, 0x00, // :	58
			                         0x00, 0x56, 0x36, 0x00, 0x00, // ;	59
			                         0x08, 0x14, 0x22, 0x41, 0x00, // <	60
			                         0x14, 0x14, 0x14, 0x14, 0x14, // =	61
			                         0x00, 0x41, 0x22, 0x14, 0x08, // >	62
			                         0x02, 0x01, 0x51, 0x09, 0x06, // ?	63
			                         0x3E, 0x41, 0x59, 0x55, 0x5E, // @	64
			                         0x7E, 0x09, 0x09, 0x09, 0x7E, // A	65	
			                         0x7F, 0x49, 0x49, 0x49, 0x36, // B	66
			                         0x3E, 0x41, 0x41, 0x41, 0x22, // C	67
			                         0x7F, 0x41, 0x41, 0x41, 0x3E, // D	68
			                         0x7F, 0x49, 0x49, 0x49, 0x41, // E	69
			                         0x7F, 0x09, 0x09, 0x09, 0x01, // F	70
			                         0x3E, 0x41, 0x41, 0x49, 0x3A, // G	71
			                         0x7F, 0x08, 0x08, 0x08, 0x7F, // H	72
			                         0x00, 0x41, 0x7F, 0x41, 0x00, // I	73
			                         0x30, 0x40, 0x40, 0x40, 0x3F, // J	74
			                         0x7F, 0x08, 0x14, 0x22, 0x41, // K	75
			                         0x7F, 0x40, 0x40, 0x40, 0x40, // L	76
			                         0x7F, 0x02, 0x0C, 0x02, 0x7F, // M	77
			                         0x7F, 0x02, 0x04, 0x08, 0x7F, // N	78
			                         0x3E, 0x41, 0x41, 0x41, 0x3E, // O	79
			                         0x7F, 0x09, 0x09, 0x09, 0x06, // P	80
			                         0x1E, 0x21, 0x21, 0x21, 0x5E, // Q	81
			                         0x7F, 0x09, 0x09, 0x09, 0x76, // R	82
									 0x26, 0x49, 0x49, 0x49, 0x32, // S	83
			                         0x01, 0x01, 0x7F, 0x01, 0x01, // T	84
			                         0x3F, 0x40, 0x40, 0x40, 0x3F, // U	85
			                         0x1F, 0x20, 0x40, 0x20, 0x1F, // V	86
			                         0x7F, 0x20, 0x10, 0x20, 0x7F, // W	87
			                         0x41, 0x22, 0x1C, 0x22, 0x41, // X	88
			                         0x07, 0x08, 0x70, 0x08, 0x07, // Y	89
			                         0x61, 0x51, 0x49, 0x45, 0x43, // Z	90
			                         0x00, 0x7F, 0x41, 0x00, 0x00, // [	91
			                         0x02, 0x04, 0x08, 0x10, 0x20, // \	92
			                         0x00, 0x00, 0x41, 0x7F, 0x00, // ]	93
			                         0x04, 0x02, 0x01, 0x02, 0x04, // ^	94
			                         0x40, 0x40, 0x40, 0x40, 0x40, // _	95
			                         0x00, 0x01, 0x02, 0x04, 0x00, // `	96
			                	     0x20, 0x54, 0x54, 0x54, 0x78, // a	98
			                         0x7F, 0x44, 0x44, 0x44, 0x38, // b	99
			                         0x38, 0x44, 0x44, 0x44, 0x44, // c	100
			                         0x38, 0x44, 0x44, 0x44, 0x7F, // d	101
			                         0x38, 0x54, 0x54, 0x54, 0x18, // e	102
			                         0x04, 0x04, 0x7E, 0x05, 0x05, // f	103
			                         0x08, 0x54, 0x54, 0x54, 0x3C, // g	104
			                         0x7F, 0x08, 0x04, 0x04, 0x78, // h	105
			                         0x00, 0x44, 0x7D, 0x40, 0x00, // i	106
			                         0x20, 0x40, 0x44, 0x3D, 0x00, // j	107
			                         0x7F, 0x10, 0x28, 0x44, 0x00, // k	108
			                         0x00, 0x41, 0x7F, 0x40, 0x00, // l	109
			                         0x7C, 0x04, 0x78, 0x04, 0x78, // m	110
			                         0x7C, 0x08, 0x04, 0x04, 0x78, // n	111
			                         0x38, 0x44, 0x44, 0x44, 0x38, // o	112
			                         0x7C, 0x14, 0x14, 0x14, 0x08, // p	113
			                         0x08, 0x14, 0x14, 0x14, 0x7C, // q	114
			                         0x00, 0x7C, 0x08, 0x04, 0x04, // r	115
			                         0x48, 0x54, 0x54, 0x54, 0x20, // s	116
			                         0x04, 0x04, 0x3F, 0x44, 0x44, // t	117
			                         0x3C, 0x40, 0x40, 0x20, 0x7C, // u	118
			                         0x1C, 0x20, 0x40, 0x20, 0x1C, // v	119
			                         0x3C, 0x40, 0x30, 0x40, 0x3C, // w	120
			                         0x44, 0x28, 0x10, 0x28, 0x44, // x	121
			                         0x0C, 0x50, 0x50, 0x50, 0x3C, // y	122
			                         0x44, 0x64, 0x54, 0x4C, 0x44, // z	123
			                         0x00, 0x08, 0x36, 0x41, 0x41, // {	124
			                         0x00, 0x00, 0x7F, 0x00, 0x00, // |	125
			                         0x41, 0x41, 0x36, 0x08, 0x00, // }	126
			                         0x02, 0x01, 0x02, 0x04, 0x02  // ~ 127
									};
#pragma romdata

//	
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *                    Declaração dos flags de software                     *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
//A definição de flags ajuda na programação e economiza memória RAM.

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *                               ENTRADAS                                  *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
// As entradas devem ser associadas a nomes para facilitar a programação e
//futuras alterações do hardware.

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *                                 SAÍDAS                              *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
// AS SAÍDAS DEVEM SER ASSOCIADAS A NOMES PARA FACILITAR A PROGRAMAÇÃO E
//FUTURAS ALTERAÇÕES DO HARDWARE.

#define CS1	 		LATBbits.LATB0		// CS1 DO LCD
#define CS2	 		LATBbits.LATB1		// CS2 DO LCD
#define RST	 		LATBbits.LATB6		// RESET DO LCD
#define RW	 		LATBbits.LATB7		// READ/WRITE DO LCD
#define RS	 		LATEbits.LATE0		// RS DO LCD
#define E	 		LATEbits.LATE1		// ENABLE DO LCD
#define BARRAMENTO	PORTD				// BARRAMENTO DO LCD
#define BARRAMENTO_TRIS	TRISD			// BARRAMENTO DO LCD

