arnaldojr/CursoPIC/labintegrado2014/Documentação/cd labtools/mclab3/Exemplos/PIC18F4550/Exemplo 23 - exemplos LCD 128 x 64/Exe4/Exe4.c
#define SDI	 		PORTBbits.RB0		// PINO SDI DO CONTROLADOR TOUCH
#define SDI_TRIS    TRISBbits.TRISB0	// PINO SDI DO CONTROLADOR TOUCH

#define SDO	 		PORTCbits.RC7		// PINO SDO DO CONTROLADOR TOUCH
#define SCK	 		PORTBbits.RB1		// PINO SCK DO CONTROLADOR TOUCH
#define CS_T 		PORTAbits.RA2		// PINO CHIP SELECT DO CONTROLADOR TOUCH

#define VENTILADOR  PORTBbits.RB4

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *                          Configurações do Pic                           *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

void main()
{
	RCON = 0x7F;					// Reset control
									// IPEN=0 modo compativel com
    								// 16F, toda int. no end. 0x0008

	PORTA = 0x00;                       //Limpa PORTA
	PORTB = 0x00;                       //Limpa PORTB
	PORTC = 0x00;		         	    //Limpa PORTC
	PORTD = 0x00;                       //Limpa PORTD
	PORTE = 0x00;                       //Limpa PORTE

	LATA = 0x00;                      	//Limpa PORTA
	LATB = 0x00;                        //Limpa PORTB
	LATC = 0x00;		     	        //Limpa PORTC
	LATD = 0x00;                        //Limpa PORTD
	LATE = 0x00;                        //Limpa PORTE

			//76543210
	TRISA = 0b11111011;                 //CONFIG DIREÇÃO DOS PINOS PORTA
	TRISB = 0b00101100;                 //CONFIG DIREÇÃO DOS PINOS PORTB
	TRISC = 0b01111101;		            //CONFIG DIREÇÃO DOS PINOS PORTC
	TRISD = 0b00000000;                 //CONFIG DIREÇÃO DOS PINOS PORTD
	TRISE = 0b00001100;                 //CONFIG DIREÇÃO DOS PINOS PORTE

	ADCON1 = 0b00001111;                //DESLIGA CONVERSORES A/D
	CMCON  = 0x07;

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *                        Inicialização do Sistema                     *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

	Delay1KTCYx(200);		// Tempo de acomodação do LCD

	glcd_init(ON);			// Inicializa LCD

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *                              Rotina principal                           *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

	glcd_text57(30,10,texto1,1,1);	// Escreve tela com texto e nome
			                        // das posições
			                        
	glcd_rect(BOT2_X1, BOT2_Y1, BOT2_X2, BOT2_Y2, 1, 1);
	glcd_text57(TXT2_X1,TXT2_Y1,texto3,1,0);
	
	glcd_rect(BOT1_X1, BOT1_Y1, BOT1_X2, BOT1_Y2, 0, 1);
	glcd_text57(TXT1_X1,TXT1_Y1,texto2,1,1);

	pos_touch_ok=0;
	
	VENTILADOR = 0;
	
	while(1)
	{
				coluna_touch = leitura_touch(X);	// Obtem posição X
				filtro_touch(X);					// Filtragem da amostra

				linha_touch = leitura_touch(Y);		// Obtem posição Y
				filtro_touch(Y);					// Filtragem da amostra
		
				if( pos_touch_ok )		// É uma posição válida (validada pelo filtro) ?
				{
                    pos_pixel_x = retorna_pixel(X, coluna_touch);
                    pos_pixel_y = retorna_pixel(Y, linha_touch);
                    
                    if(((pos_pixel_x > BOT1_X1) && (pos_pixel_x < BOT1_X2))&&((pos_pixel_y > BOT1_Y1) && (pos_pixel_y < BOT1_Y2)))
                    {
                    	glcd_rect(BOT1_X1, BOT1_Y1, BOT1_X2, BOT1_Y2, 1, 1);
                    	glcd_text57(TXT1_X1,TXT1_Y1,texto2,1,0);
                    	
                    	glcd_rect(BOT2_X1, BOT2_Y1, BOT2_X2, BOT2_Y2, 1, 0);
                        glcd_rect(BOT2_X1, BOT2_Y1, BOT2_X2, BOT2_Y2, 0, 1);
                    	glcd_text57(TXT2_X1,TXT2_Y1,texto3,1,1);
                    	
                        VENTILADOR = 1;
                    }    
				
                    if(((pos_pixel_x > BOT2_X1) && (pos_pixel_x < BOT2_X2))&&((pos_pixel_y > BOT2_Y1) && (pos_pixel_y < BOT2_Y2)))
                    {
                    	glcd_rect(BOT2_X1, BOT2_Y1, BOT2_X2, BOT2_Y2, 1, 1);
                    	glcd_text57(TXT2_X1,TXT2_Y1,texto3,1,0);
                    	
                    	glcd_rect(BOT1_X1, BOT1_Y1, BOT1_X2, BOT1_Y2, 1, 0);
                    	glcd_rect(BOT1_X1, BOT1_Y1, BOT1_X2, BOT1_Y2, 0, 1);
                    	glcd_text57(TXT1_X1,TXT1_Y1,texto2,1,1);

                        VENTILADOR = 0;
                    }  
				
					pos_touch_ok = 0;				// Reinicia flag posição válida
				}
				
    }

}

/*
**===========================================================================
**===========================================================================
**
**          FUNÇÕES DE CONTROLE DO LCD 128 X 64
**
**===========================================================================
**===========================================================================
*/

// Purpose:       Initialize a graphic LCD. This must be called before any
//                other glcd function is used.
// Inputs:        The initialization mode
//                OFF - Turns the LCD off
//                ON  - Turns the LCD on
// Date:          5/28/2003
void glcd_init(unsigned char mode)
{
    SDI_TRIS = 0;   //configura o pino como entrada
    Nop();
    Nop();
    
	RST = 1;
	E = 0;
	CS1 = 0;
	CS2 = 0;
	RS = 0;              // Set for instruction

	glcd_writeByte(SEL_GLCD_CS1, 0xC0);     // Specify first RAM line at the top
   	glcd_writeByte(SEL_GLCD_CS2, 0xC0);     // of the screen
   	glcd_writeByte(SEL_GLCD_CS1, 0x40);     // Set the column address to 0
   	glcd_writeByte(SEL_GLCD_CS2, 0x40);
   	glcd_writeByte(SEL_GLCD_CS1, 0xB8);     // Set the page address to 0
   	glcd_writeByte(SEL_GLCD_CS2, 0xB8);

	if(mode == ON)
   	{
    	glcd_writeByte(SEL_GLCD_CS1, 0x3F);	// Turn the display on
      	glcd_writeByte(SEL_GLCD_CS2, 0x3F);
   	}
   	else
   	{
    	glcd_writeByte(SEL_GLCD_CS1, 0x3E);	// Turn the display off
      	glcd_writeByte(SEL_GLCD_CS2, 0x3E);
   	}

	glcd_fillScreen(OFF);               	// Clear the display

    SDI_TRIS = 1;   //configura o pino como entrada
}
// Purpose:       Turn a pixel on a graphic LCD on or off
// Inputs:        x - the x coordinate of the pixel
//                y - the y coordinate of the pixel
//                color - ON or OFF
// Output:        1 if coordinate out of range, 0 if in range
void glcd_pixel(unsigned char x, unsigned char y, unsigned char color)
{
	unsigned char data;
	unsigned char tmp;
   	unsigned char chip = SEL_GLCD_CS1;	// Stores which chip to use on the LCD
   	
