arnaldojr/CursoPIC/labintegrado2014/Documentação/cd labtools/mclab3/Exemplos/PIC18F4550/Exemplo 23 - exemplos LCD 128 x 64/Exe4/Exe4.c
      	for(j=0; j<5; j++, x+=size)					// Loop through character byte data
		{
			for(k=0; k<7*size; k++)					// Loop through the vertical pixels
         	{
				if((pixelData[j] >> k) & 0b00000001)// Check if the pixel should be set				
            	{
               		for(l=0; l<size; l++)      		// The next two loops change the
               		{                          		// character's size
                  		for(m=0; m<size; m++)
                  		{
                     		glcd_pixel(x+m, y+k*size+l, color);// Draws the pixel
                  		}
	           		}
            	}
			}
      	}
   	}
}


// Purpose:       Fill the LCD screen with the passed in color.
//                Works much faster than drawing a rectangle to fill the screen.
// Inputs:        ON - turn all the pixels on
//                OFF - turn all the pixels off
// Dependencies:  glcd_writeByte()
void glcd_fillScreen(unsigned char color)
{
	unsigned char i, j;

   	// Loop through the vertical pages
   	for(i = 0; i<8; i++)
   	{

		// Set for instruction
		RS = 0;

      	glcd_writeByte(SEL_GLCD_CS2, 0b01000000);		// Set horizontal address to 0
		glcd_writeByte(SEL_GLCD_CS1, 0b01000000);
		glcd_writeByte(SEL_GLCD_CS2, i | 0b10111000);	// Set page address
		glcd_writeByte(SEL_GLCD_CS1, i | 0b10111000);

		// Set for data
		RS = 1;

		// Loop through the horizontal sections
      	for(j = 0; j < 64; j++)
      	{
			glcd_writeByte(SEL_GLCD_CS1, 0xFF*color);	// Turn pixels on or off
			glcd_writeByte(SEL_GLCD_CS2, 0xFF*color);	// Turn pixels on or off
      	}

   	}
}

// Purpose:       Write a byte of data to the specified chip
// Inputs:        chipSelect - which chip to write the data to
//                data - the byte of data to write

void glcd_writeByte(unsigned char chip, unsigned char data)
{
    SDI_TRIS = 0;   //configura o pino como entrada
    Nop();
    Nop();
    
	// Choose which chip to write to
	if(chip == SEL_GLCD_CS1) CS1 = 1;
   	else CS2 = 1;

	// Set for writing
	RW = 0;
	BARRAMENTO = data;
	Nop();
	Nop();
	E = 1;
	Nop();
	Nop();
	E = 0;
	Nop();
	Nop();

	// Reset the chip select lines
	CS1 = 0;
	CS2 = 0;
	
    SDI_TRIS = 1;   //configura o pino como entrada
}

// Purpose:       Reads a byte of data from the specified chip
// Ouputs:        A byte of data read from the chip
unsigned char glcd_readByte(unsigned char chip)
{
	unsigned char data=0;						// Stores the data read from the LCD

    SDI_TRIS = 0;   //configura o pino como entrada
    Nop();
    Nop();

	// Choose which chip to write to
	if(chip == SEL_GLCD_CS1) CS1 = 1;
   	else CS2 = 1;

	// Set port d to input
	BARRAMENTO_TRIS = 0xFF;

	// Set for reading
	RW = 1;
	Nop();
	Nop();
	E = 1;
	Nop();
	Nop();
	E = 0;
	Nop();
	Nop();
	E = 1;
	Nop();
	Nop();
	data = BARRAMENTO;
	Nop();
	Nop();
	E = 0;

	// Reset the chip select lines
	CS1 = 0;
	CS2 = 0;

	// Set port d to output
	BARRAMENTO_TRIS = 0x00;
    
    SDI_TRIS = 1;   //configura o pino como entrada
}
unsigned char leitura_touch(unsigned char eixo)
{
    unsigned char valor,i;
    
    CS_T = 1;       //seleciona o controlador touch
//    SDI_TRIS = 1;   //configura o pino como entrada

	Nop();
	Nop();
	
    CS_T = 0;       //seleciona o controlador touch

/*************************************************
*		  Palavra de controle ADS7843  			 *
**************************************************
* S - A2 - A1 - A0 - MODE - SFR/DFR - PD1 - PD0	 *
**************************************************
*  S           -> Start bit 					 *
*                  (nível lógico 1)              *
*                                                *
*  A2  A1  A0  -> Seleção do canal da conversão  *
*   1   0   1   =  canal X                       *
*   0   0   1   =  canal Y                       *
*                                                *
*  MODE        -> Resolução de conversão         *
*   1           =  8 bits                        *
*   0           =  16 bits                       *
*                                                *
*  SFR/DFR     -> Modo da converssão             *
*   0           =  Single ended                  *
*   1           =  Differential                  *
*                                                *
*  PD1 PD0     -> Modos de operação              *
*   0   0       =  Power down on  +  PENIRQ on   * 
*   0   1       =  Power down on  +  PENIRQ off  * 
*   1   1		=  Power down off +  PENIRQ off  *
*                                                *
*************************************************/

	if (eixo)
	  	valor = 0b11010001;	  	
	else
		valor = 0b10010001;		

	for (i=0;i<8;i++) 
	{
		if(valor&0x80)
			SDO = 1;
		else
			SDO = 0;		
	
		Nop();
		Nop();
		SCK = 1;	   	
		Nop();
		Nop();
	    SCK = 0;	   	
		Nop();
		Nop();
		valor = valor<<1;
	}
   
    SDO = 0;	   	

	Delay10TCYx(2);

	valor = 0;
	for (i=0;i<8;i++) 
	{
    	valor = valor<<1;
    	Nop();
    	Nop();
    	SCK = 1;	   	
    	Nop();
    	Nop();
        SCK = 0;	   	
    	Nop();
    	Nop();
		if(SDI == 1)
			valor = valor | 0x01;
	}

    CS_T = 1;
//    SDI_TRIS = 0;   //configura o pino como saída
    
    return valor;
}


void filtro_touch(unsigned char canal)
{
    if (canal == 0)
    {
        if (linha_touch == linha_touch_anterior)
        {
	        filtro_linha_touch_lib = t_f_touch_lib;           // reinicia filtro de debounce
	        
	        filtro_linha_touch_press--;
	        if (!filtro_linha_touch_press)
	        {
		        linha_touch_ok=1;                       // marca que linha está ok.
		    }
        }
        else
        {
	        filtro_linha_touch_press = t_f_touch_press;           // reinicia filtro de debounce

            filtro_linha_touch_lib--;
            if (!filtro_linha_touch_lib)
            {
                linha_touch_ok = 0;                       // marca que linha está ok.
				linha_touch_anterior = 0;
                pos_touch_ok = 0;
				t_f_touch_press = 10;
				t_f_touch_lib = 2;
            }
        }
        linha_touch_anterior = linha_touch;               // realiza o atraso
    }
    else
    {
        if (coluna_touch == coluna_touch_anterior)
        {
	        filtro_coluna_touch_lib = t_f_touch_lib;           // reinicia filtro de debounce

            filtro_coluna_touch_press--;
            if (!filtro_coluna_touch_press)
            {
	            coluna_touch_ok = 1;                       // marca que linha está ok.
            }
        }
        else
        {
            filtro_coluna_touch_press = t_f_touch_press;           // reinicia filtro de debounce

            filtro_coluna_touch_lib--;
             if (!filtro_coluna_touch_lib)
             {
 		         coluna_touch_ok = 0;                       // marca que linha está ok.
				 coluna_touch_anterior = 0;
                 pos_touch_ok = 0;
				 t_f_touch_press = 10;
				 t_f_touch_lib = 2;
             }
        }
        coluna_touch_anterior = coluna_touch;               // realiza o atraso
    }
    if ( linha_touch_ok && coluna_touch_ok )
	{
		pos_touch_ok = 1;
		linha_touch_ok = 0;
		coluna_touch_ok = 0;
		t_f_touch_press = 1;
		t_f_touch_lib = 2;
    }
}


unsigned char retorna_pixel(unsigned char eixo, unsigned char valor)
{
    signed int pixel;
    
    if(eixo == X)
    {
        pixel = (128*((signed int)valor - MAX_X))/(MIN_X-MAX_X);
        if(pixel < 0) return(0);
        else return((unsigned char)pixel);
    }
    else if(eixo == Y)
    {
        pixel = (64*((signed int)valor - MIN_Y))/(MAX_Y-MIN_Y);
        if(pixel < 0) return(0);
        else return((unsigned char)pixel);
    }
    else
    {
        return(0);
    }            
}   